backend/app/views/jobs/_form.html.erb

  <div class="field">
    <%= f.select :company_id, options_from_collection_for_select(@companies, :id, :name, :selected => f.object.company_id) %>
---
SELECT "companies".* FROM "companies"