backend/app/controllers/companies_controller.rb

INSERT INTO "companies" ("name", "website", "sponsored", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Solinor Oy"], ["website", ""], ["sponsored", "t"], ["created_at", "2016-01-31 20:15:48.009781"], ["updated_at", "2016-01-31 20:15:48.009781"]]
---
  def create
    @company = Company.new(company_params)

    respond_to do |format|
      if @company.save

UPDATE "companies" SET "logo" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["logo", "futurice.pnglsdf"], ["updated_at", "2016-02-09 14:49:12.585820"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @company.update(company_params)