backend/app/controllers/jobs_controller.rb

SELECT "job_tags".* FROM "job_tags" WHERE "job_tags"."job_id" = ?  [["job_id", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "job_tags" ON "tags"."id" = "job_tags"."tag_id" WHERE "job_tags"."job_id" = ?  [["job_id", 1]]
---
  def index
    @jobs = Job.where("jobs.end >= ? OR jobs.end IS NULL", Date.today).includes(:tags)

INSERT INTO "job_tags" ("job_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["job_id", 33], ["tag_id", 9], ["created_at", "2016-01-31 18:07:32.716013"], ["updated_at", "2016-01-31 18:07:32.716013"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Kirjanpito"], ["created_at", "2016-01-31 18:07:32.709275"], ["updated_at", "2016-01-31 18:07:32.709275"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT 1  [["name", "Kirjanpito"]]
---
  def create
    params.permit(:tag_list)
    @job = Job.new(job_params)

    respond_to do |format|
      if @job.save

        tag_names = params[:job][:tag_list].split(/,\s+/)
        tag_names.each { |name|
          tag = Tag.find_or_create_by(name: name.strip)

INSERT INTO "job_tags" ("job_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["job_id", 1], ["tag_id", 4], ["created_at", "2016-01-31 21:02:24.894361"], ["updated_at", "2016-01-31 21:02:24.894361"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "IoT"], ["created_at", "2016-01-31 20:58:20.825495"], ["updated_at", "2016-01-31 20:58:20.825495"]]
SELECT  "job_tags".* FROM "job_tags" WHERE "job_tags"."job_id" = ? AND "job_tags"."tag_id" = ? LIMIT 1  [["job_id", 4], ["tag_id", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT 1  [["name", "IoT"]]
---
  def update
    params.permit(:tag_list)

    respond_to do |format|
      if @job.update(job_params)

        tag_names = params[:job][:tag_list].split(/,\s+/)
        tag_names.each { |name|
          tag = Tag.find_or_create_by(name: name.strip)

SELECT  "companies".* FROM "companies" WHERE "companies"."job_id" = ? LIMIT 1  [[nil, 1]]
---
    def set_companies_for_template
      @companies = Company.all